# MaterialId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalElement..::..MaterialId Property
AnalyticalElement Class See Also
---
Defines the Material Id for the Analytical Element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public ElementId MaterialId { get; set; }
```

Visual Basic
---
```text
Public Property MaterialId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ MaterialId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The provided MaterialId is not supported |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
AnalyticalElement Class
Autodesk.Revit.DB.Structure Namespace